#-eto komentarii
print("hello world")
#**-Возведение в степень
#%-деление по модулю
#//-Целочисленные деления с отбрасываением дробной части
#/- Деление *-умножение - -вычитание + -сложение
print(23 % 7)
print(23 // 7)
# int() целочисленный тип данных, целые числа
# "" -  str() строки
# float, вещественные числа, с плаваюей точкой
my_name = "Анна "
my_friend = "Валера"
my_number = 13
print(my_name + " " + my_friend)
print(my_name + " 13 ")
print(my_name + " " + str(my_number))
print(f"{my_name} любимое число {my_number}")
print(my_name * 5)
# переменная- это область памяти компьютера, в которой может храниться одиночное значение, знак = является оператором присваивания и сохраняет значения
color = "pink"
print(color)
