#-eto komentarii
print("hello world")
#**-Возведение в степень
#%-деление по модулю
#//-Целочисленные деления с отбрасываением дробной части
#/- Деление *-умножение - -вычитание + -сложение
print(23 % 7)
print(23 // 7)
# int() целочисленный тип данных, (целые числа)
# "" -  str() строки
# float, вещественные числа, (с плаваюей точкой)
my_name = "Анна"
my_friend = "Валера"
my_number = 13
print(my_name + " " + my_friend)
print(my_name + " 13 ")
print(my_name + " " + str(my_number))
print(f"{my_name} любимое число {my_number}")# f"{переменная}строка" -функция f-string , которая делает интерполяцию

print(my_name * 5)
# переменная- это область памяти компьютера, в которой может храниться одиночное значение, знак = является оператором присваивания и сохраняет значения
color = "pink"
print(color)
# имя переменной должно предствлять собой одно слово без пробелов, в имени переменной могут использоваться только буквы, цифры, символы подчеркивания
# имя переменной не может начинаться с цифры
_1 = "my little war"
print(_1)
# переменная не обознач через - , и спец символы типа$
print(len(my_name))
#my_name = int(input("ввод:"))
#my_name1 = float(input("ввод:"))
#print("привет "+my_name)
# print(5 + my_name)
# все что введу в input  на выходе строка

# Конкатенация это сложение/склеивание строк
# Репликация умножение разных типов данных
# домашка - повторить и проработать все дома + порабтать с конк и репл и input, поработать с математическими операторами
# посмотреть инфо про функцию len() - относиться к категории встроенных функций, ознакомиться со списком встроенных функций в питоне, обратить на функцию round()
